import React from "react";

// {
//     "title": "ওয়েব ডেভেলপমেন্ট-এর চাহিদা কেমন? আর এর চাহিদা কি কমে যেতে পারে ভবিষ্যতে?",
//     "image": "https://images.pexels.com/photos/4164418/pexels-photo-4164418.jpeg?auto=compress&cs=tinysrgb&w=1600",
//     "text": "ওয়েব ডেভেলপমেন্ট তথা ওয়েবের চাহিদা ক্রমাগত বাড়তেই থাকবে। বর্তমানে অনলাইন ভিত্তিক যত সেবা তৈরি হয়েছে গত ৫ বছর আগেও সেরকমটা ছিল না। মুদি দোকান থেকে শুরু করে সবকিছুই এখন অনলাইন ভিত্তিক। এগুলো মেইন্টেনেন্স এর জন্য কিংবা এক্সটেন্ড করার জন্য সবসময়ই ওয়েব ডেভেলপারের চাহিদা থাকবে। তাছাড়া অনলাইন ভিত্তিক যতো সেবা আসছে এগুলো বাস্তবায়নের জন্য ভবিষ্যতে ডেভেলপারদের চাহিদা তৈরি হবে। নেক্সট কয়েক বছরে কমবে না বরং বাড়বে বলে মনে হচ্ছে।\\n১. আজ থেকে ৭-৮ বছর আগে ভাবছিলাম এপ ডেভেলপমেন্ট হয়তো ওয়েব ডেভেলপমেন্ট এর অনেক জব খেয়ে ফেলবে। তবে ২০২২-২৩ এসে মনে হচ্ছে-- মোবাইল ডেভেলপমেন্ট এর চাহিদা যে তালে বাড়ছে তার চাইতে বেশি তালে ওয়েব ডেভেলপমেন্ট এর জব বেড়েছে। এইটা আমি ধারণা করে বলতেছি।\\n২. এন্টারটেইনমেন্ট, কমিউনিকেশন এবং শর্টকাটে সারা পসিবল এমন অনেক কাজ আমরা মোবাইল দিয়ে বেশি করি। এইসব জায়গায় এপ এবং এপ ডেভেলপার এর চাহিদা অবশ্যই বেড়েছে। সামনে আরো বাড়বে। \\n৩. তবে প্রফেশনাল কাজগুলো কিন্তু ডেস্কটপ এবং ওয়েব সাইট দিয়েই করা হয় বেশি। এবং নেক্সট কয়েক বছর সেটা চেইঞ্জ হওয়ার চান্স দেখি না। যেমন ধরো, তুমি এসাইনমেন্ট করবে, প্রেজেটেনেশন বানাবে, ভিডিও এডিট করবে, প্রোডাক্ট ডিজাইন করবে, ওয়েব এর কোডিং করবে, মার্কেটিং ম্যানেজার মার্কেটিং প্ল্যান বানাবে। একাউন্টেন্ট হিসাব করবে। সাহিত্যিক সাহিত্য লিখবে। যারা ব্যাংকে জব করে ব্যাংকার কাজ করবে। অফিস আদালতে। সব জায়গায় ল্যাপটপ বা ডেস্কটপ ইউজ করে। আর তাই সেখানে ওয়েবসাইট এর বেশি দরকার পড়ে। ভালো পরিমাণ ফটো এডিট করলে। অনেক অনেক বড় রিপোর্ট বা অনেক বেশি ইমেইল লিখলে। তখন ওয়েবসাইট এর দরকার পড়ে। এতে ওয়েব ডেভেলপার এর দরকার আরো বেশি পড়বে।\\n৪. ডেভেলপিং কান্ট্রিগুলোতে বিশেষ করে বাংলাদেশ, ভারত, দক্ষিণ আমেরিকা, আফ্রিকা এবং মিডল ইস্টের একটা বড় অংশ ধীরে ধীরে ইন্টারনেটের সাথে যুক্ত হচ্ছে। সেটা করতে গিয়ে অনেক অনেক জায়গায় ডিজিটালাইজেশন এর দরকার পড়ে। এবং ওয়েব এপ্লিকেশন এর দরকার হচ্ছে। যেমন আগে স্কুল বা ভার্সিটিগুলার ওয়েব সাইট থাকতো না। এখন দরকার হয়ে গেছে। সেগুলা কে বানাবে। সামনে সেগুলার চাহিদা আরো বাড়বে। যদিও কিছু কিছু কাজ মোবাইল দিয়ে করার চেষ্টা করে অনেকেই। তবে প্রফেশনাল লেভেলের বেশিরভাগ কাজ মোবাইল দিয়ে করা পসিবল হয় না। তখন ওয়েবসাইট এবং ওয়েব ডেভেলপার এর দরকার আরো বেশি হবে।\\n৫. ধীরে ধীরে রিমোট জব বাংলাদেশ ঢুকতেছে। অল্প হলেও ঢুকতে শুরু করতেছে। বিশেষ করে যেসব জব রিমোটলি দূর থেকে করা সম্ভব। তাদের মধ্যে অন্যতম হচ্ছে ওয়েব ডেভেলপমেন্ট, প্রোগ্রামিং, ইত্যাদি। সো, সেজন্য সামনে জব বাড়তে পারে.\\n৬. দেশে আইটি কোম্পানির সংখ্যা ধীরে ধীরে বাড়তেছে। যেমন ধরো এডটেক হচ্ছে সামনে আরো হবে। ডেলিভারি সার্ভিস। ই-কমার্স হচ্ছে এবং সামনে আরো হবে। এইগুলার জন্য ওয়েব ডেভেলপার এর ডিমান্ড নেক্সট কিছু বছর বাড়বে বলে ধারণা করা যায়।\\n৭. আরেকটা জিনিস-- ওয়েব এর টেকনোলোজি কিন্তু ক্রমশ এডভান্স হচ্ছে। আজ থেকে ওয়েবসাইট দিয়ে আমরা যেসব কাজ করতাম এখন আরো অনেক কমপ্লেক্স এবং পাওয়ারফুল কাজ ওয়েবসাইট এ করা হয়। এবং আজ থেকে পাঁচ বছর পরে নিশ্চিত আরো আরো অনেক বেশি এডভান্সড কাজ ওয়েবসাইট দিয়ে করা হবে। আগের বানানো সাইটগুলো পুরান বা ব্যবহারযোগ্য থাকবে না। সো, সেগুলা আপডেট করার জন্য হলেও আরো অনেক অনেক ওয়েব ডেভেলপার লাগবে।",
//     "tags": [
//         "Career",
//         "Web Development",
//         "React",
//         "Javascript",
//         "Nodejs",
//         "Javascript"
//     ],
//     "seen": "2022-12-29T12:20:45.704Z",
//     "_id": "63ad8620b5c39447eeea39ca",
//     "createdAt": "2022-12-29T12:20:48.792Z",
//     "updatedAt": "2022-12-29T12:20:48.792Z",
//     "__v": 0
// }

const BlogPostCard = ({ blog }) => {
   console.log(blog);

   return (
      <div className="shadow-lg relative rounded-3xl border px-3 py-5 flex flex-col text-indigo-900">
         <div className="mx-auto">
            <img
               src={blog.image}
               alt="The pic contains some information"
               className="h-80 w-80 object-fill"
            />
         </div>

         <h1 className="font-bold py-2">{`${blog.title.slice(0, 37)}...`}</h1>

         <div className="flex-1 border-y border-y-[#445045] py-3">
            <ul className="flex items-center gap-3">
               {blog.tags.slice(0, 4).map((tag) => (
                  <li className="px-3 py-1 rounded-full bg-[#445045] text-white">{tag}</li>
               ))}
            </ul>
         </div>

         <p className="text-justify font-semibold py-2 ">
            {`${blog?.text?.slice(0, 200)}....`}
            <span className="px-3 py-1 rounded-full leading-8 bg-[#445045] text-white">
               Read More
            </span>
         </p>

         {/* <ul className="space-y-2">
                {product?.keyFeature?.map((feature, i) => {
                  return (
                     <li key={i} className="text-sm ">
                        {feature}
                     </li>
                  );
               })} 
            </ul>*/}

         {/* <div className="flex gap-2 mt-5"> */}
         {/* {!pathname.includes("cart") && (
               <button
                  onClick={() => dispatch(addToCart(product))}
                  className="bg-indigo-500 rounded-full py-1 px-2 flex-1 text-white text-bold"
               >
                  Add to cart
               </button>
            )}

            {!pathname.includes("cart") && (
               <button title="Add to wishlist" className="bg-indigo-500  py-1 px-2 rounded-full">
                  <BiListPlus className="text-white" />
               </button>
            )}
            {pathname.includes("cart") && (
               <button
                  title="Remove"
                  onClick={() => dispatch(removeFromCart(product))}
                  className="flex justify-between px-3 bg-red-500 text-white p-1 rounded-full flex-1"
               >
                  <p>Remove</p>
                  <MdDeleteForever size="25" />
               </button>
            )} */}
         {/* </div> */}
      </div>
   );
};

export default BlogPostCard;
